Tekla Open API Reference for Tekla Structures 2025
Settings.TryGetValue<T> Method (String, T)
 Tries to get the value of the setting with the given name and given object type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool TryGetValue<T>(
	string name,
	out T obj
)
Public Shared Function TryGetValue(Of T) (
	name As String,
	<OutAttribute> ByRef obj As T
) As Boolean
Parameters
name
Type: System.String
The name of the setting.
obj
Type: T
The value of the given setting.
Type Parameters
T
Type of the object to get
Return Value
Type: Boolean
True on success, false otherwise.
See Also
Reference
Settings Class
TryGetValue Overload
Tekla.Structures.Datatype Namespace